I’ve created a new main.tf.json file to focus solely on the snowflake_network_rule_resource resource. Below is the content of the main.tf.json file:

```
{
   "provider": {
      "snowflake": [
         {
            "preview_features_enabled": [
               "snowflake_network_policy_attachment_resource",
               "snowflake_network_rule_resource",
            ]
         },
         {
            "alias": "account_admin",
            "role": "ACCOUNTADMIN"
         },
         {
            "alias": "sys_admin",
            "role": "SYSADMIN"
         },
         {
            "alias": "user_admin",
            "role": "USERADMIN"
         },
         {
            "alias": "security_admin",
            "role": "SECURITYADMIN"
         },
         {
            "alias": "tag_admin",
            "role": "TAG_ADMIN"
         },
         {
            "alias": "default",
            "role": "TERRAFORM_ROLE"
         }
      ]
   },
   "resource": {
      "snowflake_network_policy": {
         "network_policy_TF_TEST_NET_POLICY": {
            "allowed_network_rule_list": [
               "SNOWFLAKE_GOV.PUBLIC.TF_V1_TEST"
            ],
            "comment": "TF V1 TEST",
            "depends_on": [
               "snowflake_network_rule.network_rule_TF_V1_TEST"
            ],
            "name": "TF_TEST_NET_POLICY",
            "provider": "snowflake.account_admin"
         }
      },
      "snowflake_network_policy_attachment": {
         "network_policy_attachment_TF_TEST_NET_POLICY_ATTACHMENT": {
            "network_policy_name": "TF_TEST_NET_POLICY",
            "provider": "snowflake.account_admin",
            "set_for_account": false,
            "users": [
               "NETWORK_POLICY_USER_1"
            ]
         }
      },
      "snowflake_network_rule": {
         "network_rule_TF_V1_TEST": {
            "comment": "This is test allow lists",
            "database": "SNOWFLAKE_GOV",
            "mode": "INGRESS",
            "name": "TF_V1_TEST",
            "provider": "snowflake.account_admin",
            "schema": "PUBLIC",
            "type": "IPV4",
            "value_list": [
               "18.138.0.0"
            ]
         }
      }
   },
   "terraform": {
      "backend": {
         "s3": {
            "bucket": "vir-prd-foc-snowflakemgmt",
            "key": "SRE_DEV/DEVELOP/terraforms.tfstate",
            "region": "us-east-1"
         }
      },
      "required_providers": {
         "aws": {
            "source": "hashicorp/aws",
            "version": "~> 5.60.0"
         },
         "snowflake": {
            "configuration_aliases": [
               "snowflake.sys_admin",
               "snowflake.user_admin",
               "snowflake.account_admin",
               "snowflake.security_admin",
               "snowflake.tag_admin",
               "snowflake.default"
            ],
            "source": "Snowflake-Labs/snowflake",
            "version": "1.0.1"
         }
      }
   }
}

```

the  output of terraform apply as below
```

 $ terraform apply -auto-approve  

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # snowflake_network_policy.network_policy_TF_TEST_NET_POLICY will be created
  + resource "snowflake_network_policy" "network_policy_TF_TEST_NET_POLICY" {
      + allowed_network_rule_list = [
          + "SNOWFLAKE_GOV.PUBLIC.TF_V1_TEST",
        ]
      + comment                   = "TF V1 TEST"
      + describe_output           = (known after apply)
      + fully_qualified_name      = (known after apply)
      + id                        = (known after apply)
      + name                      = "TF_TEST_NET_POLICY"
      + show_output               = (known after apply)
    }

  # snowflake_network_policy_attachment.network_policy_attachment_TF_TEST_NET_POLICY_ATTACHMENT will be created
  + resource "snowflake_network_policy_attachment" "network_policy_attachment_TF_TEST_NET_POLICY_ATTACHMENT" {
      + id                  = (known after apply)
      + network_policy_name = "TF_TEST_NET_POLICY"
      + set_for_account     = false
      + users               = [
          + "NETWORK_POLICY_USER_1",
        ]
    }

  # snowflake_network_rule.network_rule_TF_V1_TEST will be created
  + resource "snowflake_network_rule" "network_rule_TF_V1_TEST" {
      + comment              = "This is test allow lists"
      + database             = "SNOWFLAKE_GOV"
      + fully_qualified_name = (known after apply)
      + id                   = (known after apply)
      + mode                 = "INGRESS"
      + name                 = "TF_V1_TEST"
      + schema               = "PUBLIC"
      + type                 = "IPV4"
      + value_list           = [
          + "18.138.0.0",
        ]
    }

Plan: 3 to add, 0 to change, 0 to destroy.
snowflake_network_policy_attachment.network_policy_attachment_TF_TEST_NET_POLICY_ATTACHMENT: Creating...
snowflake_network_rule.network_rule_TF_V1_TEST: Creating...
╷
│ Error: snowflake_network_policy_attachment_resource is currently a preview feature, and must be enabled by adding snowflake_network_policy_attachment_resource to `preview_features_enabled` in Terraform configuration.
│ 
│   with snowflake_network_policy_attachment.network_policy_attachment_TF_TEST_NET_POLICY_ATTACHMENT,
│   on main.tf.json line 60, in resource.snowflake_network_policy_attachment.network_policy_attachment_TF_TEST_NET_POLICY_ATTACHMENT:
│   60:          }
│ 
╵
╷
│ Error: snowflake_network_rule_resource is currently a preview feature, and must be enabled by adding snowflake_network_rule_resource to `preview_features_enabled` in Terraform configuration.
│ 
│   with snowflake_network_rule.network_rule_TF_V1_TEST,
│   on main.tf.json line 74, in resource.snowflake_network_rule.network_rule_TF_V1_TEST:
│   74:          }
│ ```